app/controllers/sessions_controller.rb

	def create
		user = User.find_by_email(params[:sessions][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT 1